Repository: jazzband/djangorestframework-simplejwt
Catalog: rest_framework_simplejwt/locale/*/LC_MESSAGES/django.po
Languages: az, kk

source: The user's password has been changed.
kk: Пайдаланушының құпия сөзі өзгертілді.

source: Authorization header must contain two space-delimited values
az: Avtorizasiya başlığında boşluqla ayrılmış iki dəyər olmalıdır
kk: Авторизация тақырыптамасында бос орынмен бөлінген екі мән болуы керек

source: Given token not valid for any token type
az: Verilən token hər hansı bir token növü üçün keçərli deyil
kk: Берілген токен ешбір токен түріне жарамсыз

source: Token contained no recognizable user identification
az: Token heç bir tanınan istifadəçi identifikasiyasına malik deyil
kk: Токенде пайдаланушы идентификаторы жоқ

source: User not found
az: İstifadəçi tapılmadı
kk: Пайдаланушы табылмады

source: User is inactive
az: İstifadəçi aktiv deyil
kk: Пайдаланушы өшірулі

source: Unrecognized algorithm type '{}'
az: Tanınmayan alqortim tipi '{}'
kk: Белгісіз алгоритм түрі '{}'

source: You must have cryptography installed to use {}.
az: {} istifadə edə bilmək üçün cryptography yükləməniz lazımdır.
kk: {} пайдалану үшін cryptography орнатылған болуы керек.

source: Unrecognized type '{}', 'leeway' must be of type int, float or timedelta.
az: Tanınmayan tip '{}', 'leeway' int, float və timedelta tipindən birində olmalıdır.
kk: Белгісіз түр '{}', 'leeway' мәні int, float немесе timedelta түрінде болуы керек.

source: Token is invalid
kk: Токен жарамсыз

source: Invalid algorithm specified
az: Etibarsız alqoritm göstərildi
kk: Көрсетілген алгоритм жарамсыз

source: Token is expired
kk: Токеннің мерзімі өткен

source: Token is invalid or expired
az: Token etibarsızdır və ya vaxtı keçmişdir
kk: Токен жарамсыз немесе мерзімі өткен

source: No active account found with the given credentials
az: Verilən məlumatlar üçün aktiv hesab tapılmadı
kk: Көрсетілген тіркелгі деректері бойынша есептік жазба табылмады.

source: No active account found for the given token.
kk: Көрсетілген токен бойынша есептік жазба табылмады.

source: Token is blacklisted
az: Token qara siyahıya salınmışdır
kk: Токен қара тізімге енгізілген

source: The '{}' setting has been removed. Please refer to '{}' for available settings.
az: '{}' parametri silindi. Mövcud parametrlər üçün '{}' ünvanına baxın.
kk: '{}' параметрі жойылды. Қол жетімді параметрлер үшін '{}' қараңыз.

source: user
az: istifadəçi
kk: пайдаланушы

source: created at
az: yaranma tarixi
kk: құрылған уақыты

source: expires at
az: bitmə tarixi
kk: мерзімі аяқталатын уақыт

source: Token Blacklist
az: Token qara siyahısı
kk: Токендердің қара тізімі

source: Outstanding Token
kk: Қолданыстағы токен

source: Outstanding Tokens
kk: Қолданыстағы токендер

source: Token for %(user)s (%(jti)s)
kk: %(user)s үшін токен (%(jti)s)

source: Blacklisted Token
kk: Қара тізімдегі токен

source: Blacklisted Tokens
kk: Қара тізімдегі токендер

source: Blacklisted token for %(user)s
kk: %(user)s пайдаланушысына тиесілі қара тізімдегі токен

source: Cannot create token with no type or lifetime
az: Tipi və ya etibarlılıq vaxtı olmadan token yaratmaq olmaz
kk: Түрі немесе жарамдылық мерзімі көрсетілмеген токенді жасау мүмкін емес

source: Token has no id
az: Token'in id-si yoxdur
kk: Токенде идентификатор жоқ

source: Token has no type
az: Token-nin tipi yoxdur
kk: Токенде түрі көрсетілмеген

source: Token has wrong type
az: Token-nin tipi yanlışdır
kk: Токеннің түрі қате

source: Token has no '{}' claim
az: Token-in '{}' claim-i yoxdur
kk: Токенде '{}' талап мерзімі жоқ

source: Token '{}' claim has expired
az: Token-in '{}' claim-i bitmişdir
kk: Токеннің '{}' талап мерзімі аяқталған
